/**
 * @param {number} num
 * @return {string[]}
 */
var readBinaryWatch = function (num) {
    const res = []
    // 小时灯最多能有 3 个灯同时亮，枚举每一种亮灯时的小时时间
    const hourstrs = [["0"], ["1", "2", "4", "8"], ["3", "5", "6", "9", "10"], ["7", "11"]]
    // 分钟灯最多有 5 个灯同时亮，枚举每一种亮灯时的分钟时间
    const minstrs = [
        ["00"],
        ["01", "02", "04", "08", "16", "32"],
        ["03", "05", "06", "09", "10", "12", "17", "18", "20", "24", "33", "34", "36", "40", "48"],
        ["07", "11", "13", "14", "19", "21", "22", "25", "26", "28", "35", "37", "38", "41", "42", "44", "49", "50", "52", "56"],
        ["15", "23", "27", "29", "30", "39", "43", "45", "46", "51", "53", "54", "57", "58"],
        ["31", "47", "55", "59"]
    ]

    // 从 0 开始循环，但保证 i 不能超过小时灯亮起最多的数量： 3（即不能超出数组的限制)
    for (let i = 0; i <= Math.min(3, num); i++) {
        // 保证不超过分钟灯亮起最多的数量： 5 (即不能超出数组的限制)
        if (num - i > 5) continue;
        const hstr = hourstrs[i];
        const mstr = minstrs[num - i];
        for (let j = 0; j < hstr.length; j++) {
            for (let k = 0; k < mstr.length; k++) {
                res.push(hstr[j] + ":" + mstr[k]);
            }
        }
    }
    return res
}